## Plan Result (prod_shutter_webapp)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;child-adoption&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;child-adoption&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;child-adoption&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;child-adoption&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;child-adoption&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["child-adoption"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["child-adoption"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.www"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["child-adoption"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "child-adoption"
      + resource_group_name = "cft-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["child-adoption"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "www.apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["child-adoption"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "child_adoption_prod"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1821,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_webapp","Vars":{}} -->